Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 256, 64)      128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 254, 254, 64)      36928     
_________________________________________________________________
re_lu (ReLU)                 (None, 254, 254, 64)      0         
_________________________________________________________________
batch_normalization (BatchNo (None, 254, 254, 64)      256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 252, 252, 64)      36928     
_________________________________________________________________
re_lu_1 (ReLU)               (None, 252, 252, 64)      0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 252, 252, 64)      256       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 250, 250, 64)      36928     
_________________________________________________________________
re_lu_2 (ReLU)               (None, 250, 250, 64)      0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 250, 250, 64)      256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 248, 248, 32)      18464     
_________________________________________________________________
re_lu_3 (ReLU)               (None, 248, 248, 32)      0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 248, 248, 32)      128       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 246, 246, 32)      9248      
_________________________________________________________________
re_lu_4 (ReLU)               (None, 246, 246, 32)      0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 246, 246, 32)      128       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 244, 244, 32)      9248      
_________________________________________________________________
re_lu_5 (ReLU)               (None, 244, 244, 32)      0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 244, 244, 32)      128       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 242, 242, 16)      4624      
_________________________________________________________________
re_lu_6 (ReLU)               (None, 242, 242, 16)      0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 242, 242, 16)      64        
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 240, 240, 16)      2320      
_________________________________________________________________
re_lu_7 (ReLU)               (None, 240, 240, 16)      0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 240, 240, 16)      64        
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 242, 242, 16)      2320      
_________________________________________________________________
re_lu_8 (ReLU)               (None, 242, 242, 16)      0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 242, 242, 16)      64        
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 244, 244, 16)      2320      
_________________________________________________________________
re_lu_9 (ReLU)               (None, 244, 244, 16)      0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 244, 244, 16)      64        
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 246, 246, 32)      4640      
_________________________________________________________________
re_lu_10 (ReLU)              (None, 246, 246, 32)      0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 246, 246, 32)      128       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 248, 248, 32)      9248      
_________________________________________________________________
re_lu_11 (ReLU)              (None, 248, 248, 32)      0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 248, 248, 32)      128       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 250, 250, 32)      9248      
_________________________________________________________________
re_lu_12 (ReLU)              (None, 250, 250, 32)      0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 250, 250, 32)      128       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 252, 252, 64)      18496     
_________________________________________________________________
re_lu_13 (ReLU)              (None, 252, 252, 64)      0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 252, 252, 64)      256       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 254, 254, 64)      36928     
_________________________________________________________________
re_lu_14 (ReLU)              (None, 254, 254, 64)      0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 254, 254, 64)      256       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 256, 256, 64)      36928     
_________________________________________________________________
re_lu_15 (ReLU)              (None, 256, 256, 64)      0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 256, 256, 64)      256       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 256, 256, 1)       65        
=================================================================
Total params: 277,569
Trainable params: 276,289
Non-trainable params: 1,280
_________________________________________________________________
