Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 256, 32)      64        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 254, 254, 32)      9248      
_________________________________________________________________
re_lu (ReLU)                 (None, 254, 254, 32)      0         
_________________________________________________________________
batch_normalization (BatchNo (None, 254, 254, 32)      128       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 252, 252, 32)      9248      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 252, 252, 32)      0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 252, 252, 32)      128       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 250, 250, 32)      9248      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 250, 250, 32)      0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 250, 250, 32)      128       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 248, 248, 32)      9248      
_________________________________________________________________
re_lu_3 (ReLU)               (None, 248, 248, 32)      0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 248, 248, 32)      128       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 246, 246, 32)      9248      
_________________________________________________________________
re_lu_4 (ReLU)               (None, 246, 246, 32)      0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 246, 246, 32)      128       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 244, 244, 32)      9248      
_________________________________________________________________
re_lu_5 (ReLU)               (None, 244, 244, 32)      0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 244, 244, 32)      128       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 242, 242, 32)      9248      
_________________________________________________________________
re_lu_6 (ReLU)               (None, 242, 242, 32)      0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 242, 242, 32)      128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 240, 240, 32)      9248      
_________________________________________________________________
re_lu_7 (ReLU)               (None, 240, 240, 32)      0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 240, 240, 32)      128       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 238, 238, 32)      9248      
_________________________________________________________________
re_lu_8 (ReLU)               (None, 238, 238, 32)      0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 238, 238, 32)      128       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 236, 236, 32)      9248      
_________________________________________________________________
re_lu_9 (ReLU)               (None, 236, 236, 32)      0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 236, 236, 32)      128       
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 234, 234, 32)      9248      
_________________________________________________________________
re_lu_10 (ReLU)              (None, 234, 234, 32)      0         
_________________________________________________________________
batch_normalization_10 (Batc (None, 234, 234, 32)      128       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 232, 232, 32)      9248      
_________________________________________________________________
re_lu_11 (ReLU)              (None, 232, 232, 32)      0         
_________________________________________________________________
batch_normalization_11 (Batc (None, 232, 232, 32)      128       
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 234, 234, 32)      9248      
_________________________________________________________________
re_lu_12 (ReLU)              (None, 234, 234, 32)      0         
_________________________________________________________________
batch_normalization_12 (Batc (None, 234, 234, 32)      128       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 236, 236, 32)      9248      
_________________________________________________________________
re_lu_13 (ReLU)              (None, 236, 236, 32)      0         
_________________________________________________________________
batch_normalization_13 (Batc (None, 236, 236, 32)      128       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 238, 238, 32)      9248      
_________________________________________________________________
re_lu_14 (ReLU)              (None, 238, 238, 32)      0         
_________________________________________________________________
batch_normalization_14 (Batc (None, 238, 238, 32)      128       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 240, 240, 32)      9248      
_________________________________________________________________
re_lu_15 (ReLU)              (None, 240, 240, 32)      0         
_________________________________________________________________
batch_normalization_15 (Batc (None, 240, 240, 32)      128       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 242, 242, 32)      9248      
_________________________________________________________________
re_lu_16 (ReLU)              (None, 242, 242, 32)      0         
_________________________________________________________________
batch_normalization_16 (Batc (None, 242, 242, 32)      128       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 244, 244, 32)      9248      
_________________________________________________________________
re_lu_17 (ReLU)              (None, 244, 244, 32)      0         
_________________________________________________________________
batch_normalization_17 (Batc (None, 244, 244, 32)      128       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 246, 246, 32)      9248      
_________________________________________________________________
re_lu_18 (ReLU)              (None, 246, 246, 32)      0         
_________________________________________________________________
batch_normalization_18 (Batc (None, 246, 246, 32)      128       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 248, 248, 32)      9248      
_________________________________________________________________
re_lu_19 (ReLU)              (None, 248, 248, 32)      0         
_________________________________________________________________
batch_normalization_19 (Batc (None, 248, 248, 32)      128       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 250, 250, 32)      9248      
_________________________________________________________________
re_lu_20 (ReLU)              (None, 250, 250, 32)      0         
_________________________________________________________________
batch_normalization_20 (Batc (None, 250, 250, 32)      128       
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 252, 252, 32)      9248      
_________________________________________________________________
re_lu_21 (ReLU)              (None, 252, 252, 32)      0         
_________________________________________________________________
batch_normalization_21 (Batc (None, 252, 252, 32)      128       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 254, 254, 32)      9248      
_________________________________________________________________
re_lu_22 (ReLU)              (None, 254, 254, 32)      0         
_________________________________________________________________
batch_normalization_22 (Batc (None, 254, 254, 32)      128       
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 256, 256, 32)      9248      
_________________________________________________________________
re_lu_23 (ReLU)              (None, 256, 256, 32)      0         
_________________________________________________________________
batch_normalization_23 (Batc (None, 256, 256, 32)      128       
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 256, 256, 1)       33        
=================================================================
Total params: 225,121
Trainable params: 223,585
Non-trainable params: 1,536
_________________________________________________________________
