_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 256, 256, 1)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 256, 128)     256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 254, 254, 128)     147584    
_________________________________________________________________
re_lu (ReLU)                 (None, 254, 254, 128)     0         
_________________________________________________________________
batch_normalization_v1 (Batc (None, 254, 254, 128)     512       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 252, 252, 128)     147584    
_________________________________________________________________
re_lu_1 (ReLU)               (None, 252, 252, 128)     0         
_________________________________________________________________
batch_normalization_v1_1 (Ba (None, 252, 252, 128)     512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 250, 250, 64)      73792     
_________________________________________________________________
re_lu_2 (ReLU)               (None, 250, 250, 64)      0         
_________________________________________________________________
batch_normalization_v1_2 (Ba (None, 250, 250, 64)      256       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 248, 248, 64)      36928     
_________________________________________________________________
re_lu_3 (ReLU)               (None, 248, 248, 64)      0         
_________________________________________________________________
batch_normalization_v1_3 (Ba (None, 248, 248, 64)      256       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 246, 246, 64)      36928     
_________________________________________________________________
re_lu_4 (ReLU)               (None, 246, 246, 64)      0         
_________________________________________________________________
batch_normalization_v1_4 (Ba (None, 246, 246, 64)      256       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 244, 244, 32)      18464     
_________________________________________________________________
re_lu_5 (ReLU)               (None, 244, 244, 32)      0         
_________________________________________________________________
batch_normalization_v1_5 (Ba (None, 244, 244, 32)      128       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 242, 242, 32)      9248      
_________________________________________________________________
re_lu_6 (ReLU)               (None, 242, 242, 32)      0         
_________________________________________________________________
batch_normalization_v1_6 (Ba (None, 242, 242, 32)      128       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 240, 240, 32)      9248      
_________________________________________________________________
re_lu_7 (ReLU)               (None, 240, 240, 32)      0         
_________________________________________________________________
batch_normalization_v1_7 (Ba (None, 240, 240, 32)      128       
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 242, 242, 32)      9248      
_________________________________________________________________
re_lu_8 (ReLU)               (None, 242, 242, 32)      0         
_________________________________________________________________
batch_normalization_v1_8 (Ba (None, 242, 242, 32)      128       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 244, 244, 32)      9248      
_________________________________________________________________
re_lu_9 (ReLU)               (None, 244, 244, 32)      0         
_________________________________________________________________
batch_normalization_v1_9 (Ba (None, 244, 244, 32)      128       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 246, 246, 32)      9248      
_________________________________________________________________
re_lu_10 (ReLU)              (None, 246, 246, 32)      0         
_________________________________________________________________
batch_normalization_v1_10 (B (None, 246, 246, 32)      128       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 248, 248, 64)      18496     
_________________________________________________________________
re_lu_11 (ReLU)              (None, 248, 248, 64)      0         
_________________________________________________________________
batch_normalization_v1_11 (B (None, 248, 248, 64)      256       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 250, 250, 64)      36928     
_________________________________________________________________
re_lu_12 (ReLU)              (None, 250, 250, 64)      0         
_________________________________________________________________
batch_normalization_v1_12 (B (None, 250, 250, 64)      256       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 252, 252, 64)      36928     
_________________________________________________________________
re_lu_13 (ReLU)              (None, 252, 252, 64)      0         
_________________________________________________________________
batch_normalization_v1_13 (B (None, 252, 252, 64)      256       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 254, 254, 128)     73856     
_________________________________________________________________
re_lu_14 (ReLU)              (None, 254, 254, 128)     0         
_________________________________________________________________
batch_normalization_v1_14 (B (None, 254, 254, 128)     512       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 256, 256, 128)     147584    
_________________________________________________________________
re_lu_15 (ReLU)              (None, 256, 256, 128)     0         
_________________________________________________________________
batch_normalization_v1_15 (B (None, 256, 256, 128)     512       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 256, 256, 1)       129       
=================================================================
Total params: 826,049
Trainable params: 823,873
Non-trainable params: 2,176
_________________________________________________________________
