Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 256, 256, 1)]     0         
_________________________________________________________________
conv2d (Conv2D)              (None, 256, 256, 16)      32        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 254, 254, 16)      2320      
_________________________________________________________________
re_lu (ReLU)                 (None, 254, 254, 16)      0         
_________________________________________________________________
batch_normalization (BatchNo (None, 254, 254, 16)      64        
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 252, 252, 16)      2320      
_________________________________________________________________
re_lu_1 (ReLU)               (None, 252, 252, 16)      0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 252, 252, 16)      64        
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 254, 254, 16)      2320      
_________________________________________________________________
re_lu_2 (ReLU)               (None, 254, 254, 16)      0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 254, 254, 16)      64        
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 256, 256, 16)      2320      
_________________________________________________________________
re_lu_3 (ReLU)               (None, 256, 256, 16)      0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 256, 256, 16)      64        
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 256, 256, 1)       17        
=================================================================
Total params: 9,585
Trainable params: 9,457
Non-trainable params: 128
_________________________________________________________________
